Завдання:
1 - Для описаної предметної області створити реляційну БД, яка відповідає 3-ій нормальній формі.
2 - При створенні таблиць - взяти до уваги необхідність забезпечення сутнісної та реляційної цілісності.
2 - Для створеної бази створити необхідні додаткові об'єкти (зьережені процедури, функції тощо).

Рекомендації/вимоги:
- Перш ніж приступати до завдання - продумайте, які вам знадобляться "допоміжні" таблиці;
таблиці повинні бути забезпечені обмеженнями (на вашу розсуд); при накладанні обмежень -
наводьте, у коментарях причини їх застосування, будь ласка .
- При створенні таблиць залишайте коментар, наприклад: "у цій таблиці зберігатимемо дані щодо учнів,
вона буде зв'язуватися з таблицею такою по такому полю, тому що ..."
- При накладанні обмежень наводьте коментар. Наприклад: "дата народження не може бути NULL тому що ..."
- Не зайвим буде залишити необхідні коментарі щодо процесу виконання, наприклад: "Створюю таблицю Teachers:",
"Наповнюю таблицю Teachers:" і т.д. Під описом задачі наводимо скрипт (формат як у домашках).
- Таблиці наповнюємо мінімальною кількістю кортежів для отримання інформативних вибірок,
(наприклад, учнів може бути і 5-10, а от класів, достатньо і 3-4).
- Враховуйте, що невелика кількість інформації, яка буде у вашій БД може призвести до хибно-позитивних результатів тестування створенних вами скриптів. 
Розраховуємо на те, що коли наша база "вийде на прод" - вона обслуговуватиме супер-школи з тисячами учнів та десятками класів і все має працювати без помилок.

Для наступного опису спректувати та реалізувати реляційну базу даних:
- Предметна область - школа.
- У школі є учні, які навчатимуться у класах, у кожного учня є ім'я, прізвище,
дата народження, дата прийому до школи.
- У школі є персонал: вчителі, завучі, різнороби та директор.
- Кожен співробітник має ім'я, прізвище, дату народження, дату прийому на роботу, оклад
та (якщо він вчитель) категорію.
- Вчитель може читати декілька предметів у різних класах. Вчитель може бути одночасно завуч.
- Клас має одного вчителя як класного керівника.
- Клас має спеціалізацію.
- Директор - це колишній учитель, який має оклад, категорію, але не може бути
закріплений за класами як керівник та бути постійним викладачем з
предметів, які він, як вчитель, знає.
- Різнороби не можуть викладати предмети та бути класними керівниками.
- Учням читаються предмети, предмет може читатися кількома вчителями.
- Учні навчатимуться у класах, у кожного класу своя спеціалізація (математика/біологія/мови та ін.), назва та класний керівник.
- Учні отримують з предметів заліки (по одному предмету у учня може бути (або не бути) лише одна оцінка).
- Спеціалізації класів описується короткою назвою та розгорнутим поясненням.
- Оклади вчителів (з міркувань безпеки директора) – містяться в окремій таблиці.

Для спроектованої бази даних реалізувати такі об'єкти та навести приклад їхнього виклику:
- В'юшка, яка виводить ім'я та оклад співробітника.
- В'юшка, яка показує кількість учнів зі спеціалізацій.
- В'юшка, Що показує новеньких учнів (вчаться у школі до трьох місяців).
- Процедура для призначення вчителя директором.
- Процедура для додавання учня.
- Процедура для додавання персоналу школи.
- Процедура для розрахунку кількості учнів на викладача.
- Тригер, який недопускає призначення нового викладача без вказівки його акредитації (замість цього виводимо на повідомлення із попередженням).
- Тригер що не дає додати співробітника ьез зарплатні.
- Функція що повертає кількість учнів у класі.
- Функція що повертає віднощення зарплатні до кількості уінів, яких навчає цей вчитель.
