
-- Завдання 5 - підзапити

--1. Вивести назви товарів, що знаходяться в тій же категорії, що і Tofu
--2. Вивести імена територій що знаходяться в тому ж регіоні що Dallas
--3. Вивести ім'я категорії, яка продала найменше товарів (за кількістю).
--4. Вивести ім'я товарів, у яких ціна менша ніж у товару Tofu та CHAI
--5. Вивести назви товарів, чия ціна більш ніж середня ціна за товарами категорії Seafood
--6. Вивести імена товарів, ціна яких більш ніж на 20 дорожча за Tofu
--7. Вивести постачальників, які не поставляють товари категорії Confections



